Австралия/src/AccumulationRegisters/BankReconciliation/BankReconciliation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BankReconciliation</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Transaction</name>
    <type>
      <types>DocumentRef.ForeignCurrencyExchange</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.BankReconciliation</types>
      <types>DocumentRef.CashTransfer</types>
      <types>DocumentRef.PaymentReceipt</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.BankReconciliationTransactionTypes</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Documents/ForeignCurrencyExchange/ForeignCurrencyExchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ForeignCurrencyExchange</name>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpensesCashMethod</registerRecords>
  <registerRecords>AccumulationRegister.BankCharges</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.BankReconciliation</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.CashAssets</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>FromAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>FromAccountCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>FromAccountExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FromAccountMultiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ToAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>ToAccountCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ToAccountExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ToAccountMultiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>BankCharge</name>
    <type>
      <types>CatalogRef.BankCharges</types>
    </type>
  </attributes>
  <attributes>
    <name>BankChargeItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>BankFeeValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CashExchange</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalReceivingCurrency</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ManualTotalReceivingCurrency</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Catalogs/BusinessUnits/BusinessUnits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BusinessUnits</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>MainDepartment</name>
      <description>Main department</description>
    </items>
    <items>
      <name>MainWarehouse</name>
      <description>Main warehouse</description>
    </items>
    <items>
      <name>DropShipping</name>
      <description>Drop shipping</description>
    </items>
  </predefined>
  <attributes>
    <name>StructuralUnitType</name>
    <type>
      <types>EnumRef.BusinessUnitsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>FRP</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountInRetail</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>MarkupGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientOfWastes</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningInterval</name>
    <type>
      <types>EnumRef.PlanningIntervals</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningIntervalDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/AccumulationRegisters/BankReconciliation/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	BankReconciliation.LineNumber AS LineNumber,
	|	BankReconciliation.BankAccount AS BankAccount,
	|	BankReconciliation.Transaction AS Transaction,
	|	BankReconciliation.TransactionType AS TransactionType,
	|	BankReconciliation.Amount AS AmountBeforeWrite,
	|	BankReconciliation.Amount AS AmountChange,
	|	BankReconciliation.Amount AS AmountOnWrite
	|INTO RegisterRecordsBankReconciliationChange
	|FROM
	|	AccumulationRegister.BankReconciliation AS BankReconciliation");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsBankReconciliationChange", False);
	
EndProcedure

Function BalancesControlQueryText() Export
	
	Return
	"SELECT ALLOWED
	|	RegisterRecordsBankReconciliationChange.LineNumber AS LineNumber,
	|	RegisterRecordsBankReconciliationChange.BankAccount AS BankAccount,
	|	RegisterRecordsBankReconciliationChange.Transaction AS Transaction,
	|	RegisterRecordsBankReconciliationChange.TransactionType AS TransactionType,
	|	ISNULL(CASE
	|			WHEN BankReconciliationTurnovers.AmountReceipt < 0
	|				THEN -BankReconciliationTurnovers.AmountReceipt
	|			ELSE BankReconciliationTurnovers.AmountReceipt
	|		END, 0) AS Amount,
	|	ISNULL(CASE
	|			WHEN BankReconciliationTurnovers.AmountExpense < 0
	|				THEN -BankReconciliationTurnovers.AmountExpense
	|			ELSE BankReconciliationTurnovers.AmountExpense
	|		END, 0) AS AmountCleared
	|FROM
	|	RegisterRecordsBankReconciliationChange AS RegisterRecordsBankReconciliationChange
	|		LEFT JOIN AccumulationRegister.BankReconciliation.Turnovers(, , , ) AS BankReconciliationTurnovers
	|		ON RegisterRecordsBankReconciliationChange.BankAccount = BankReconciliationTurnovers.BankAccount
	|			AND RegisterRecordsBankReconciliationChange.Transaction = BankReconciliationTurnovers.Transaction
	|			AND RegisterRecordsBankReconciliationChange.TransactionType = BankReconciliationTurnovers.TransactionType
	|		LEFT JOIN Catalog.BankAccounts AS CatalogBankAccounts
	|		ON RegisterRecordsBankReconciliationChange.BankAccount = CatalogBankAccounts.Ref
	|WHERE
	|	ISNULL(BankReconciliationTurnovers.AmountTurnover, 0) <> 0
	|	AND ISNULL(BankReconciliationTurnovers.AmountExpense, 0) <> 0
	|	AND NOT ISNULL(CatalogBankAccounts.AllowNegativeBalance, FALSE)
	|
	|ORDER BY
	|	LineNumber";
	
EndFunction

Procedure GenerateOrDeleteRecordsOnChangingFunctionalOption(Parameters, StorageAddress) Export
	
	SetPrivilegedMode(True);
	
	If Parameters.UseBankReconciliation Then
		GenerateRecords();
	Else
		DeleteRecords();
	EndIf;
	
EndProcedure

Function TransactionCleared(Transaction, BankAccount = Undefined) Export
	
	Query = New Query;
	
	Query.Text =
	"SELECT ALLOWED TOP 1
	|	TRUE AS Cleared
	|FROM
	|	AccumulationRegister.BankReconciliation AS BankReconciliation
	|WHERE
	|	&BankAccount
	|	AND BankReconciliation.Transaction = &Transaction
	|	AND BankReconciliation.RecordType = VALUE(AccumulationRecordType.Expense)";
	
	Query.SetParameter("Transaction", Transaction);
	// BankAccount condition is used to fit the main register index
	// without it the result will be slower, but still correct
	If BankAccount = Undefined Then
		Query.SetParameter("BankAccount", True);
	Else
		Query.Text = StrReplace(Query.Text, "&BankAccount", "BankReconciliation.BankAccount = &BankAccount");
		Query.SetParameter("BankAccount", BankAccount);
	EndIf;
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

#EndRegion

#Region Private

Procedure GenerateRecords()
	
	RecorderFilter = CreateRecordSet().Filter.Recorder;
	RecorderTypes = RecorderFilter.ValueType.Types();
	
	For Each RecorderType In RecorderTypes Do
		
		DocumentMetadata = Metadata.FindByType(RecorderType);
		
		If Not DocumentMetadata = Undefined Then
			
			Query = New Query;
			Query.Text = StrReplace(
				"SELECT ALLOWED
				|	DocumentTable.Ref AS Ref
				|FROM
				|	&DocumentTable AS DocumentTable
				|WHERE
				|	DocumentTable.Posted",
				"&DocumentTable",
				DocumentMetadata.FullName());
			
			Sel = Query.Execute().Select();
			
			While Sel.Next() Do
				
				GenerateDocumentRecords(Sel.Ref, DocumentMetadata);
				
			EndDo;
			
		EndIf;
		
	EndDo;
	
EndProcedure

Procedure GenerateDocumentRecords(DocumentRef, DocumentMetadata)
	
	BeginTransaction();
	
	Try
		
		DocumentObject = DocumentRef.GetObject();
		AdditionalProperties = DocumentObject.AdditionalProperties;
		RegisterRecords = DocumentObject.RegisterRecords;
		
		DriveServer.InitializeAdditionalPropertiesForPosting(DocumentRef, AdditionalProperties);
		
		If TypeOf(DocumentObject) = Type("DocumentObject.ForeignCurrencyExchange") Then
			AdditionalProperties.Insert("CalculatedData", Documents.ForeignCurrencyExchange.GetCalculatedData(DocumentObject));
			If GetFunctionalOption("UseSeveralDepartments") Then 
				AdditionalProperties.ForPosting.Insert("StructuralUnit", DocumentObject.StructuralUnit);
			Else 
				AdditionalProperties.ForPosting.Insert("StructuralUnit", Catalogs.BusinessUnits.MainDepartment);
			EndIf;
		EndIf;
		
		Documents[DocumentMetadata.Name].InitializeDocumentData(DocumentRef, AdditionalProperties);
		
		DriveServer.ReflectBankReconciliation(AdditionalProperties, RegisterRecords, False);
		RegisterRecords.BankReconciliation.Write();
		
		AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
		
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		
		DefaultLanguageCode = CommonClientServer.DefaultLanguageCode();
		
		ErrorDescription = StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Cannot save document ""%1"". Details: %2'; ru = 'Не удалось записать документ ""%1"". Подробнее: %2';pl = 'Nie można zapisać dokumentu ""%1"". Szczegóły: %2';es_ES = 'Ha ocurrido un error al guardar el documento ""%1"". Detalles: %2';es_CO = 'Ha ocurrido un error al guardar el documento ""%1"". Detalles: %2';tr = '""%1"" belgesi saklanamıyor. Ayrıntılar: %2';it = 'Impossibile salvare il documento ""%1"". Dettagli: %2';de = 'Fehler beim Speichern des Dokuments ""%1"". Details: %2'", DefaultLanguageCode),
			DocumentRef,
			BriefErrorDescription(ErrorInfo()));
		
		WriteLogEvent(
			NStr("en = 'BankReconciliationInitialGeneration'; ru = 'ПервичноеГенерированиеВзаиморасчетовСБанком';pl = 'BankReconciliationInitialGeneration';es_ES = 'BankReconciliationInitialGeneration';es_CO = 'BankReconciliationInitialGeneration';tr = 'BankReconciliationInitialGeneration';it = 'BankReconciliationInitialGeneration';de = 'BankReconciliationInitialGeneration'", DefaultLanguageCode),
			EventLogLevel.Error,
			DocumentMetadata,
			,
			ErrorDescription);
		
	EndTry;
	
EndProcedure

Procedure DeleteRecords()
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED DISTINCT
	|	BankReconciliation.Recorder AS Recorder
	|FROM
	|	AccumulationRegister.BankReconciliation AS BankReconciliation";
	
	Sel = Query.Execute().Select();
	
	While Sel.Next() Do
		
		RecordSet = CreateRecordSet();
		RecordSet.Filter.Recorder.Set(Sel.Recorder);
		RecordSet.Write(True);
		
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
